alpha_0.95/0/UDDES
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/






FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      UDDES;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   nonuniform List<vector> 
17348
(
( -0.002618701896 0.002600883134 -0.0001404051727 )
( -0.002793685533 0.002791879233 -0.0001462641958 )
( -0.002335272264 0.002282535657 -0.000135727445 )
( -0.002825085772 0.00283276313 -0.000150735621 )
( -0.002565519884 0.002532854909 -0.0001433242578 )
( -0.001991151366 0.001915854169 -0.0001305383485 )
( -0.002958951984 0.003020013915 -0.0001605757134 )
( -0.002556321677 0.002520401264 -0.0001458007027 )
...
)
;

boundaryField
{
    hill
    {
        type            calculated;
        value           uniform ( 0 0 0 );
    }
    top-wall
    {
        type            calculated;
        value           uniform ( 0 0 0 );
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
    cyclicAMI_outlet
    {
        type            cyclicAMI;
        value           uniform ( 0 0 0 );
    }
    cyclicAMI_inlet
    {
        type            cyclicAMI;
        value           uniform ( 0 0 0 );
    }
}


// ************************************************************************* //
